CSI API ETABS v1
cDetailing.GetDetailedSlabTopBarData Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedSlabTopBarData(
	string SlabName,
	ref int NumData,
	ref string[] Names,
	ref int[] NumBars,
	ref double[] BarDiameter,
	ref string[] BarNotation,
	ref string[] BarMaterial,
	ref double[] StartX,
	ref double[] StartY,
	ref double[] StartZ,
	ref double[] EndX,
	ref double[] EndY,
	ref double[] EndZ,
	ref double[] WidthLeft,
	ref double[] WidthRight,
	ref double[] OffsetFromTop,
	ref double[] OffsetFromBot,
	ref int[] StartBarBend,
	ref int[] EndBarBend,
	ref string[] GUIDs
)
Function GetDetailedSlabTopBarData (
	SlabName As String,
	ByRef NumData As Integer,
	ByRef Names As String(),
	ByRef NumBars As Integer(),
	ByRef BarDiameter As Double(),
	ByRef BarNotation As String(),
	ByRef BarMaterial As String(),
	ByRef StartX As Double(),
	ByRef StartY As Double(),
	ByRef StartZ As Double(),
	ByRef EndX As Double(),
	ByRef EndY As Double(),
	ByRef EndZ As Double(),
	ByRef WidthLeft As Double(),
	ByRef WidthRight As Double(),
	ByRef OffsetFromTop As Double(),
	ByRef OffsetFromBot As Double(),
	ByRef StartBarBend As Integer(),
	ByRef EndBarBend As Integer(),
	ByRef GUIDs As String()
) As Integer
Dim instance As cDetailing
Dim SlabName As String
Dim NumData As Integer
Dim Names As String()
Dim NumBars As Integer()
Dim BarDiameter As Double()
Dim BarNotation As String()
Dim BarMaterial As String()
Dim StartX As Double()
Dim StartY As Double()
Dim StartZ As Double()
Dim EndX As Double()
Dim EndY As Double()
Dim EndZ As Double()
Dim WidthLeft As Double()
Dim WidthRight As Double()
Dim OffsetFromTop As Double()
Dim OffsetFromBot As Double()
Dim StartBarBend As Integer()
Dim EndBarBend As Integer()
Dim GUIDs As String()
Dim returnValue As Integer
returnValue = instance.GetDetailedSlabTopBarData(SlabName,
	NumData, Names, NumBars, BarDiameter,
	BarNotation, BarMaterial, StartX,
	StartY, StartZ, EndX, EndY, EndZ, WidthLeft,
	WidthRight, OffsetFromTop, OffsetFromBot,
	StartBarBend, EndBarBend, GUIDs)
int GetDetailedSlabTopBarData(
	String^ SlabName,
	int% NumData,
	array<String^>^% Names,
	array<int>^% NumBars,
	array<double>^% BarDiameter,
	array<String^>^% BarNotation,
	array<String^>^% BarMaterial,
	array<double>^% StartX,
	array<double>^% StartY,
	array<double>^% StartZ,
	array<double>^% EndX,
	array<double>^% EndY,
	array<double>^% EndZ,
	array<double>^% WidthLeft,
	array<double>^% WidthRight,
	array<double>^% OffsetFromTop,
	array<double>^% OffsetFromBot,
	array<int>^% StartBarBend,
	array<int>^% EndBarBend,
	array<String^>^% GUIDs
)
abstract GetDetailedSlabTopBarData :
        SlabName : string *
        NumData : int byref *
        Names : string[] byref *
        NumBars : int[] byref *
        BarDiameter : float[] byref *
        BarNotation : string[] byref *
        BarMaterial : string[] byref *
        StartX : float[] byref *
        StartY : float[] byref *
        StartZ : float[] byref *
        EndX : float[] byref *
        EndY : float[] byref *
        EndZ : float[] byref *
        WidthLeft : float[] byref *
        WidthRight : float[] byref *
        OffsetFromTop : float[] byref *
        OffsetFromBot : float[] byref *
        StartBarBend : int[] byref *
        EndBarBend : int[] byref *
        GUIDs : string[] byref -> int
Parameters
SlabName
Type: System.String
NumData
Type: System.Int32
Names
Type: System.String[]
NumBars
Type: System.Int32[]
BarDiameter
Type: System.Double[]
BarNotation
Type: System.String[]
BarMaterial
Type: System.String[]
StartX
Type: System.Double[]
StartY
Type: System.Double[]
StartZ
Type: System.Double[]
EndX
Type: System.Double[]
EndY
Type: System.Double[]
EndZ
Type: System.Double[]
WidthLeft
Type: System.Double[]
WidthRight
Type: System.Double[]
OffsetFromTop
Type: System.Double[]
OffsetFromBot
Type: System.Double[]
StartBarBend
Type: System.Int32[]
EndBarBend
Type: System.Int32[]
GUIDs
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDetailing Interface
ETABSv1 Namespace